infrastructure/experiments/leastconn-2/ab_10_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient).....done


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2704 bytes

Concurrency Level:      1
Time taken for tests:   0.160 seconds
Complete requests:      10
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Total transferred:      28810 bytes
HTML transferred:       26990 bytes
Requests per second:    62.37 [#/sec] (mean)
Time per request:       16.033 [ms] (mean)
Time per request:       16.033 [ms] (mean, across all concurrent requests)
Transfer rate:          175.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.1      1       1
Processing:    12   15   1.7     15      18
Waiting:       12   15   1.7     15      18
Total:         13   16   1.7     16      19

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     16
  75%     17
  80%     18
  90%     19
  95%     19
  98%     19
  99%     19
 100%     19 (longest request)
